#+TITLE: FP-NOTES
#+AUTHOR: Hugo L. Ávila
#+OPTIONS: broken-links:mark
#+PROPERTY: header-args :results drawer output
#+STARTUP: overview

** Transparência Referencial
A transparência referencial é uma propriedade de funções puras na qual elas podem ser livremente substituídas em uma expressão pelo valor que produzem, sem modificar o comportamento ou o resultado da expressão.

#+BEGIN_SRC python :exports both
  def add(a: int, b: int) -> int:
      return a + b

  def mut(a: int, b: int) -> int:
      return a * b

  print((2 + 3) * 4 + 2 == add(mut(add(2, 3), 4), 2))
  print((5 * 4) + 2 == add(add(2, 3) * 4, 2))
#+END_SRC

#+RESULTS:
:results:
True
True
:end:

** Expressão sem transparência referencial
#+BEGIN_SRC python
  import random

  class IntMaroto(int):
      def __add__(self, other):
          return self.real + other.real + random.choice([0, 1, 1.0])

  def add(a: int, b: int) -> int:
      return IntMaroto(a) + b

  def mut(a: int, b: int) -> int:
      return a * b

  print((2 + 3) * 4 + 2 == add(mut(add(2, 3), 4), 2))
  print((5 * 4) + 2 == add(add(2, 3) * 4, 2))
#+END_SRC

#+RESULTS:
:results:
True
False
:end:

*** Unique kmer counter
#+BEGIN_SRC python
  def get_kmer_count(dna, k):
      kmers = {}
      size_of_sequence = len(dna)
      for i in range(size_of_sequence):
          kmer = dna[i:i+k]
          if not len(kmer) == k:
              continue
          if not kmer in kmers:
              kmers[kmer] = 0
          kmers[kmer] += 1
      return kmers

  seq = 'AGGTCCCTGGTCAGG'
  kmer_size = 3
  print(get_kmer_count(seq, kmer_size))
      
#+END_SRC

#+RESULTS:
:results:
{'AGG': 2, 'GGT': 2, 'GTC': 2, 'TCC': 1, 'CCC': 1, 'CCT': 1, 'CTG': 1, 'TGG': 1, 'TCA': 1, 'CAG': 1}
:end:

*** Take 3
#+BEGIN_SRC python
  from functools import reduce

  cmap = lambda f: lambda it: map(f, it)
  cfilter = lambda f: lambda it: filter(f, it)
  creduce = lambda f: lambda i: lambda it: reduce(f, it, i)

  def compose(*functions):
      return reduce(lambda g, f: lambda v: f(g(v)), functions, lambda x: x)

  def get_kmer_countFC(dna: str, k: int) -> dict[str, int]:
      return compose(
          len,
          range,
          cmap(lambda i: dna[i:i+k]),
          cfilter(lambda x: len(x) == k),
          creduce(lambda d, kmer: {**d, kmer: d.get(kmer, 0) + 1})(dict())
      )(dna)

  seq = 'AGGTCCCTGGTCAGG'
  kmer_size = 3
  print(get_kmer_countFC(seq, kmer_size))
#+END_SRC

#+RESULTS:
:results:
{'AGG': 2, 'GGT': 2, 'GTC': 2, 'TCC': 1, 'CCC': 1, 'CCT': 1, 'CTG': 1, 'TGG': 1, 'TCA': 1, 'CAG': 1}
:end:

